app/views/notes/show.html.erb


    <% if @note.comments.count > 0 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."note_id" = ?  ORDER BY "comments"."created_at" ASC  [["note_id", 480050258]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."note_id" = ?  [["note_id", 480050258]]