app/views/projects/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."project_id" = ?  ORDER BY "notes"."created_at" DESC  [["project_id", 980190962]]
SELECT COUNT(*) FROM "notes" WHERE "notes"."project_id" = ?  [["project_id", 980190962]]
---
  <h2 class="page-header"><%= @project.name %></h2>
  <h3>Notes <small><%= pluralize @project.notes.count, "note" %></small></h3>