app/controllers/comments_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ?  ORDER BY "notes"."created_at" DESC LIMIT 1  [["id", 980190962]]
INSERT INTO "comments" ("text", "note_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "hey i'm text"], ["note_id", 980190962], ["created_at", "2015-07-02 23:41:30.214390"], ["updated_at", "2015-07-02 23:41:30.214390"]]
---
  def create
    @note = Note.find(params[:note_id])
    @comment = @note.comments.build(comment_params)

    if @comment.save