app/controllers/notes_controller.rb

	def index
		@notes = Note.all
---
SELECT "notes".* FROM "notes"  ORDER BY "notes"."created_at" DESC

  def new
		@project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", nil]]

  def create
		@project = Project.find(params[:project_id])
  	@note = @project.notes.build(note_params)

    if @note.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 980190962]]
INSERT INTO "notes" ("title", "text", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test Note"], ["text", "Example text"], ["project_id", 980190962], ["created_at", "2015-07-08 00:26:55.565618"], ["updated_at", "2015-07-08 00:26:55.565618"]]
INSERT INTO "projects" ("name", "created_at", "updated_at", "id") VALUES ('Project One', '2015-07-07 19:47:58', '2015-07-07 19:47:58', 980190962)

	def update
		if @note.update(note_params)
---
UPDATE "notes" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "Update title"], ["text", "Update text"], ["updated_at", "2015-07-03 17:03:51.506730"], ["id", 980190962]]

	def add_tag
		@new_tags = @note.add_tags(params[:tag_string])

		unless @note.save
---
INSERT INTO "notes" ("title", "text", "created_at", "updated_at", "id", "project_id") VALUES ('MyString', 'MyText', '2015-07-21 18:55:23', '2015-07-21 18:55:23', 980190962, 980190962)
INSERT INTO "tags" ("name") VALUES (?)  [["name", "tag_name"]]
UPDATE "tags" SET "taggings_count" = COALESCE("taggings_count", 0) + 1 WHERE "tags"."id" = ?  [["id", 1]]

	def remove_tag
		# TODO: refactor this and add_tag, they're basically the same
		@tag_string = params[:tag_string]
		@note.tag_list.remove(@tag_string, parse: true)

		unless @note.save
---
UPDATE "tags" SET "taggings_count" = COALESCE("taggings_count", 0) - 1 WHERE "tags"."id" = ?  [["id", 1]]

	def destroy
		if @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 980190962]]

			def set_note_ivar
				@note = Note.find(params[:id])
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ?  ORDER BY "notes"."created_at" DESC LIMIT 1  [["id", 980190962]]