app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Valid Name"], ["created_at", "2015-07-07 16:39:52.289269"], ["updated_at", "2015-07-07 16:39:52.289269"]]

    def set_project_ivar
      @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 980190962]]