app/controllers/scaffold_tests_controller.rb

SELECT "scaffold_tests".* FROM "scaffold_tests"
---
  def index
    @scaffold_tests = ScaffoldTest.all

INSERT INTO "scaffold_tests" ("text", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "MyString"], ["score", 1], ["created_at", "2015-07-03 16:29:11.513930"], ["updated_at", "2015-07-03 16:29:11.513930"]]
---
  def create
    @scaffold_test = ScaffoldTest.new(scaffold_test_params)

    respond_to do |format|
      if @scaffold_test.save

DELETE FROM "scaffold_tests" WHERE "scaffold_tests"."id" = ?  [["id", 980190962]]
---
  def destroy
    @scaffold_test.destroy

SELECT  "scaffold_tests".* FROM "scaffold_tests" WHERE "scaffold_tests"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_scaffold_test
      @scaffold_test = ScaffoldTest.find(params[:id])